"use strict";

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface) {
    await queryInterface.bulkInsert("Kpkv", [
      {
        name: "2101020_4",
        info: "Забезпечення функціонування системи зв'язку Збройних Сил України, захисту інформації та кібербезпеки в інформацийно-телекомунікаційних системах",
      },
      {
        name: "2101150_6",
        info: "Забезпечення розвитку системи зв'язку, захисту інформації та кібернетичної безпеки в інформаційно-комунікаційних системах",
      },
      {
        name: "2101020_35_7",
        info: "Матеріально-технічне забезпечення Збройних Сил України за рахунок благодійної допомоги, коштів, отриманих від спрямування 10% частини податку на доходи фізичних осіб та коштів, отриманих у якості субвенції",
      },
      {
        name: "2101150_12_7",
        info: "Закупівля озброєння, військової (спеціальної) техніки, боєприпасів, засобів та обладнання за рахунок благодійної допомоги, коштів, отриманих від спрямування 10% частин податку на доходи фізичних осіб та коштів, отриманих у якості субвенції",
      },
    ]);
  },
  async down(queryInterface) {
    await queryInterface.bulkDelete("Kpkv", null, {});
  },
};
