"use strict";

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface) {
    await queryInterface.bulkInsert("Kekv", [
      {
        name: "2210.030",
        info: "Придбання матеріалів, малоцінних предметів, обладнання, меблів, інвентарю, інструментів тощо, а також комплектувальних виробів і деталейдля ремонту всіх видів виробничого та невиробничого обладнання",
      },
      {
        name: "2210.050",
        info: "Придбання витратних та інших матеріалів до комп'ютерної техніки та оргтехніки, пасивного мережевого обладнання",
      },
      { name: "2210.100", info: "Інши видатки, які не виділені окремо" },
      {
        name: "2240.010",
        info: "Оплата всіх видів послуг зв'язку (у тому числі інтернету)",
      },
      {
        name: "2240.040",
        info: "Оплата послуг з поточного ремонту та технічного обслуговування транспортних засобів, обладнання, техніки тощо",
      },
      {
        name: "2240.090",
        info: "Оплата послуг з технічного обслуговування обладнання та адміністрування програмного забезпечення",
      },
      { name: "2240.120", info: "Інші видатки, які не виділені окремо" },
      { name: "2260.080", info: "" },
      {
        name: "2260.090",
        info: "Закупівля (модернізація, відновлення боєздатності, утримання, експлуатація, ремонт) військової техніки зв'язку",
      },
      { name: "2260.240", info: "" },
      { name: "2800.010", info: "" },
      {
        name: "3110.030",
        info: "Придбання оргтехніки, комп'ютерної техніки (у тому числі придбання програмного забезпечення, яке передбачене разом з придбанням комп'ютерної техніки), активного мережевого та телекомунікаційного обладнання",
      },
    ]);
  },
  async down(queryInterface) {
    await queryInterface.bulkDelete("Kekv", null, {});
  },
};
