const kFinanceHeaders = <String>[
  'Особовий рахунок',
  'Найменування',
  'Код видатків',
  'Всього',
  '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12',
  'Примітка',
  'Номер пропозиції',
  'Розрахунки', // ← було: 'Напрям видатків'
  'Дії',
];

const kFlexMap = {
  'Особовий рахунок': 10,
  'Найменування': 12,
  'Код видатків': 10,
  'Всього': 8,
  '1': 6, '2': 6, '3': 6, '4': 6, '5': 6, '6': 6,
  '7': 6, '8': 6, '9': 6, '10': 6, '11': 6, '12': 6,
  'Примітка': 18,
  'Номер пропозиції': 10,
  'Розрахунки': 14, // ← було 'Напрям видатків'
  'Дії': 12,
};
